{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no functionality implemented.",
  "feature_evidence.json": "Feature evidence report documenting five debugging and fixing tasks related to state management, cargo item handling, and component rendering in the cargo loading planner application.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including types, utilities, components, and configuration files with details about their functionality and recent debugging enhancements.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a logistics-themed UI with neutral grays and accent colors.",
  "frontend/index.html": "HTML entry point for the Cargo Loading Planner application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component managing cargo items state, container selection, and placement operations with extensive debug logging and handlers for adding, deleting, placing, and removing cargo items.",
  "frontend/src/components/Canvas3DFallback.tsx": "Fallback component displaying loading spinner or error messages with troubleshooting tips when 3D canvas fails to initialize or WebGL is unavailable.",
  "frontend/src/components/CargoBox3D.tsx": "3D cargo box mesh component rendering individual cargo items with color, selection state, edges, and labels, positioned correctly with bottom at y-coordinate.",
  "frontend/src/components/CargoBoxLabel.tsx": "Text label component for 3D cargo boxes using @react-three/drei Text with white color and black outline at specified 3D position.",
  "frontend/src/components/CargoForm.tsx": "Form component for adding cargo items with inputs for name, dimensions, unit, weight, and quantity, including validation and debug logging on submission.",
  "frontend/src/components/CargoList.tsx": "Displays a table of cargo items with drag-and-drop functionality, showing placement status, dimensions, weight, quantity, and delete actions. Includes empty state and placement progress badge.",
  "frontend/src/components/Container3DView.tsx": "Renders a 3D interactive container visualization using React Three Fiber, displaying placed cargo items, drag preview, container wireframe, floor grid, and layer summary. Handles item placement, selection, and removal.",
  "frontend/src/components/ContainerSelector.tsx": "Provides a grid of selectable container type cards displaying dimensions and volume, with visual highlighting for the selected container.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors, with special handling and troubleshooting tips for Three.js/WebGL rendering errors.",
  "frontend/src/components/LayerSummary.tsx": "Displays a floating card overlay showing the number of boxes per layer and total box count in the 3D container view.",
  "frontend/src/components/Layout.tsx": "Main application layout component with header (logo and title), main content area, and footer with attribution link.",
  "frontend/src/components/LoadSummary.tsx": "Displays container load statistics including volume utilization percentage with progress bar, placed vs total cargo volume, and weight metrics with color-coded indicators.",
  "frontend/src/data/containerTypes.ts": "Defines standard shipping container specifications (20ft, 40ft, 40ft High Cube) with dimensions in meters.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useDragPreview.ts": "React hook that manages drag-and-drop preview state for cargo placement, tracking the dragged item, its position, and validity during the drag operation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for a professional logistics theme, including light/dark mode variables for colors, borders, and cargo-specific accent utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/types/cargo.ts": "TypeScript type definitions for cargo items with 3D positioning, including interfaces for Position3D, CargoItem with placement metadata, Layer grouping, and utility functions for volume and dimension calculations.",
  "frontend/src/types/container.ts": "TypeScript type definitions for standard shipping container types (20ft, 40ft, 40ftHC) with dimensional specifications in meters.",
  "frontend/src/utils/calculations.ts": "Utility functions for calculating cargo and container volumes, utilization percentages, total weight, and filtering placed items with defensive error handling and logging.",
  "frontend/src/utils/colors.ts": "Color generation utilities for cargo items, providing consistent HSL-based colors from item IDs and a predefined color palette for visual differentiation.",
  "frontend/src/utils/layering.ts": "Functions for detecting and grouping placed cargo items into horizontal layers based on Y-coordinates, then assigning sequential box numbers within each layer for organized load planning.",
  "frontend/src/utils/placement.ts": "3D collision detection and validation utilities for cargo placement, including bounding box calculations, container bounds checking, collision detection with placed items, and grid snapping.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, border radius, custom fonts (Inter, JetBrains Mono), and keyframe animations for accordion and other UI components.",
  "project_state.json": "Project state document describing a web-based cargo loading planner with React/TypeScript frontend, Three.js 3D visualization, and Motoko backend on Internet Computer, tracking 7+ implemented features and known issues with React Three Fiber component usage and cargo rendering."
}