{
  "backend/main.mo": "Empty Motoko actor serving as the backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting debugging tasks for LoadSummary, Container3DView, LayerSummary components and defensive error handling in App.tsx with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend source files including components, utilities, types, and configuration files with focus on debugging, error handling, and 3D visualization features.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a logistics-themed UI with neutral grays and accent colors.",
  "frontend/index.html": "HTML entry point for the Cargo Loading Planner application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component managing container selection, cargo items state, drag-and-drop placement operations with comprehensive console logging for debugging and defensive null checks.",
  "frontend/src/components/Canvas3DFallback.tsx": "Fallback UI component displaying loading spinner or detailed error messages with troubleshooting tips when 3D canvas initialization fails or WebGL is unavailable.",
  "frontend/src/components/CargoBox3D.tsx": "3D cargo box mesh component with selection, hover states, edge rendering, and layer-box number labels using React Three Fiber with extensive debug logging.",
  "frontend/src/components/CargoBoxLabel.tsx": "Text label component for 3D cargo boxes using @react-three/drei Text with white color, black outline, and centered positioning.",
  "frontend/src/components/CargoForm.tsx": "Form component for adding cargo items with fields for name, dimensions (length/width/height), unit selection, weight, and quantity. Validates inputs and resets form after submission.",
  "frontend/src/components/CargoList.tsx": "Displays a table of cargo items with drag-and-drop functionality for unplaced items, showing placement status, dimensions, weight, quantity, and delete actions. Shows empty state when no items exist.",
  "frontend/src/components/Container3DView.tsx": "Main 3D visualization component using React Three Fiber to render container wireframe, floor grid, placed cargo boxes, and drag preview with validation. Includes interactive scene setup and layer summary integration.",
  "frontend/src/components/ContainerSelector.tsx": "Grid of selectable container type cards displaying dimensions and volume, with visual highlighting for the selected container. Includes defensive checks for empty container data.",
  "frontend/src/components/ErrorBoundary.tsx": "React error boundary component that catches and displays errors with special handling for Three.js/WebGL errors, showing troubleshooting tips and reload option. Includes detailed error logging in development mode.",
  "frontend/src/components/LayerSummary.tsx": "Displays a floating card overlay showing layer-by-layer box count summary with total count. Includes defensive checks for empty or invalid layer data.",
  "frontend/src/components/Layout.tsx": "Main application layout wrapper with header (logo and title), main content area, and footer with caffeine.ai attribution link. Provides consistent page structure across the app.",
  "frontend/src/components/LoadSummary.tsx": "React component that displays load summary statistics (volume utilization, weight, item counts) for placed cargo items with progress bars and color-coded warnings.",
  "frontend/src/data/containerTypes.ts": "Defines standard shipping container specifications (20ft, 40ft, 40ft High Cube) with dimensions in meters.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor instance based on Internet Identity authentication state, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useDragPreview.ts": "Custom React hook managing drag-and-drop preview state for cargo placement, tracking active drag, item position, and validity.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow and identity persistence using @dfinity/auth-client.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using an industrial logistics color scheme with cargo-accent orange utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/types/cargo.ts": "TypeScript type definitions for cargo items with 3D positioning, dimensions, weight, and helper functions for volume calculations and unit conversions.",
  "frontend/src/types/container.ts": "TypeScript type definitions for shipping container specifications including ID, name, and dimensions in meters.",
  "frontend/src/utils/calculations.ts": "Utility functions for calculating cargo volumes, container volumes, utilization percentages, total weights, and filtering placed items with defensive error handling.",
  "frontend/src/utils/colors.ts": "Color generation utilities providing consistent HSL colors based on item IDs and a predefined palette for cargo visualization.",
  "frontend/src/utils/layering.ts": "Provides utility functions to detect layers of cargo items based on Y-coordinate position, group items into layers with a threshold, and assign sequential box numbers within each layer sorted by X and Z coordinates.",
  "frontend/src/utils/placement.ts": "Contains validation utilities for 3D cargo placement including bounding box collision detection, container boundary checks, and functions to verify valid placement positions without overlaps.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, container settings, border radius variables, font families (Inter, JetBrains Mono), and animation keyframes for UI components.",
  "project_state.json": "Project metadata tracking a web-based cargo loading planner with React/TypeScript frontend, Motoko backend on Internet Computer, existing features for container selection and 3D visualization, and known issues with React Three Fiber component usage."
}